---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Analysis.AnalysisResultSchema
source: html/fed7870b-9418-0890-4ef8-27f4bea4f331.htm
---
# AnalysisResultSchema Members

Constructs a new copy of the input AnalysisResultSchema object.